[
    {
        "Name": "Gary Koller",
        "Information": "Gary Koller worked at the Arnold Arboretum for over two decades, serving as Managing Horticulturist and Supervisor of Living Collections. During his time there, he played a key role in overseeing the Arboretum’s extensive plant collections, and his work included the introduction of new plant species such as the Seven-Son Flower (Heptacodium). After his tenure at the Arboretum, he established Koller and Associates, focusing on garden design, and became a well-regarded lecturer in horticulture."
    },
    {
        "Name": "Kyle Port",
        "Information": "Kyle Port is the Manager of Plant Records at the Arnold Arboretum, where he plays a significant role in managing plant documentation and participating in expeditions to collect important species for the Arboretum’s living collections. He has been involved in various plant exploration missions, including a notable trip to northern Idaho, where he and his team collected numerous species that are new to the Arboretum. These efforts are part of a broader 10-year campaign aimed at enhancing the Arboretum’s scientific and conservation capabilities."
    },
    {
        "Name": "Susan Kelley",
        "Information": "Susan Kelley was a project manager at the Arnold Arboretum, where she coordinated plant exploration efforts, particularly in China’s Hengduan Mountains, a region known for its biodiversity. Her work involved managing collaborations between Harvard and Chinese institutions to collect and conserve plant species. Kelley later moved to the Wyss Institute for Biologically Inspired Engineering to continue her contributions to research on plant biodiversity."
    },
    {
        "Name": "John H. \"Jack\" Alexander III",
        "Information": "John H. \"Jack\" Alexander III served as the plant propagator at the Arnold Arboretum from 1976 to 2016, a career spanning 40 years. During his tenure, he was known for his expertise in propagating woody plants and introducing new cultivars, including the popular Syringa x chinensis ‘Lilac Sunday’. His contributions to plant propagation earned him recognition within the horticultural community, and he remains celebrated for his work on lilacs and other species."
    },
    {
        "Name": "Irina Kadis",
        "Information": "Irina Kadis is a botanist who has worked as a curatorial assistant at the Arnold Arboretum. Her expertise lies in plant identification and conservation, particularly focusing on species such as willows. Kadis has contributed to numerous botanical studies, providing guidance on native and non-native plant communities in Massachusetts. She is known for her work in documenting spontaneous flora, which has supported conservation and research efforts at the Arboretum."
    },
    {
        "Name": "Kathryn Richardson",
        "Information": "Kathryn Richardson is a research assistant and plant curator at the Arnold Arboretum, where she focuses on maintaining accurate records of the living collections. She holds an MA from Harvard Extension School and has contributed to publications like Arnoldia, where she has written about specific plant species, such as Magnolia kobus, and the fungi at the Arboretum. Her work involves both field research and documentation, ensuring the collections remain a valuable resource for botanical studies."
    },
    {
        "Name": "Jonathan Damery",
        "Information": "Jonathan Damery served as the editor of Arnoldia, the magazine of the Arnold Arboretum, where he led its relaunch and introduced new literary styles and original artwork. He has written extensively on the intersection of nature and human environments, with a focus on botanical themes. Damery holds an MFA in literary nonfiction and has contributed various essays on topics related to trees, plants, and environmental history."
    },
    {
        "Name": "John Olmsted",
        "Information": "John Olmsted served as Head Arborist until 2002."
    },
    {
        "Name": "Richard Alden Howard",
        "Information": "Richard Alden Howard (1917–2003) was a prominent American botanist and plant taxonomist, who served as the Director of the Arnold Arboretum from 1954 to 1977. Howard was particularly well-known for his expertise in tropical biology and his major work, Flora of the Lesser Antilles, a six-volume series published between 1974 and 1989. During World War II, he played a key role in the U.S. Army Air Corps, where he developed the Jungle Survival Program, for which he was awarded the Legion of Merit in 1947. His leadership at the Arboretum significantly advanced plant taxonomy and the institution's global research initiatives."
    },
    {
        "Name": "Gary Koller",
        "Information": "Gary Koller served as the Director of Horticulture at the Arnold Arboretum for 22 years. During his tenure, he focused on enhancing the living collections and contributing to various horticultural initiatives. He is currently the president of Koller and Associates, a garden design firm, and an instructor for the Landscape Institute of the Arnold Arboretum. Koller is also an international lecturer and has received numerous awards for his contributions to environmental horticulture, and his designs have been featured in several prominent garden tours (Boston Flora)."
    },
    {
        "Name": "Eric Youngerman",
        "Information": "Eric Youngerman is a research assistant at the Arnold Arboretum of Harvard University, where he contributes to various botanical studies and supports the institution's mission to advance knowledge of woody plants through research and education. He holds a Bachelor of Science in Biology from the University of Utah, where he gained experience in plant systematics and phylogenetics. His academic background and practical experience enhance his role at the Arboretum, particularly in projects involving plant identification and classification."
    },
    {
        "Name": "Jennifer L. Hicks",
        "Information": "Jennifer L. Hicks was a contributor to the Arnold Arboretum's publications in the 1970s and 1980s. She authored several articles in Arnoldia, the Arboretum's magazine, including reviews and reports on events such as Hurricane Gloria. Her work provided valuable insights into the Arboretum's activities and the impact of natural events on its collections."
    },
    {
        "Name": "Sue A. Pfeiffer",
        "Information": "Sue A. Pfeiffer is a horticulturist and former Curatorial Fellow at the Arnold Arboretum. In 2009, she authored an article in Arnoldia detailing the history and ornamental features of Hydrangea paniculata 'Praecox', an early-blooming cultivar introduced to the Arboretum. Pfeiffer also contributed to the 2017 weather summary for the Arboretum, analyzing the impact of climatic conditions on plant health and horticultural practices. Additionally, she has led educational events, such as a Tree Mob™ focused on the culinary uses of shagbark hickory bark."
    },
    {
        "Name": "Tom Ward",
        "Information": "Tom Ward is a horticulturist who has contributed to the Arnold Arboretum's publications. In 2003, he co-authored an article in Arnoldia titled \"Sun-Loving Shrubs and Vines for the Leventritt Garden,\" which discusses the selection and placement of plants in the Arboretum's Leventritt Shrub and Vine Garden. Ward's work focuses on the horticultural qualities of various species and cultivars, aiming to enhance the Arboretum's collections and educational offerings."
    },
    {
        "Name": "Ethan Johnson",
        "Information": "Ethan Johnson is the Plant Records Curator at Holden Forests & Gardens, encompassing both the Holden Arboretum and the Cleveland Botanical Garden. His tenure at the Holden Arboretum began in 1981, with a brief period at the Arnold Arboretum from 1985 to 1989, before returning to Holden in 1989, where he continues to serve. Throughout his career, Ethan has been actively involved with organizations such as the International Dendrological Research Institute, the Ohio Nursery and Landscape Association Plant Selection Committee, and the American Conifer Society. Notably, he played a pivotal role in the American Association of Museums accrediting the Holden Arboretum as the sixth public garden in the U.S. recognized as a museum."
    },
    {
        "Name": "Stephanie Stuber",
        "Information": "Stephanie Stuber served as a curatorial fellow at the Arnold Arboretum. In August 2012, during a field inventory in the Explorers Garden on Bussey Hill, she and Plant Records Manager Kyle Port observed the Arboretum’s signature Korean littleleaf boxwood (Buxus sinica var. insularis). This observation led to efforts in preserving and renewing important plant lineages at the Dana Greenhouses."
    },
    {
        "Name": "Kevin Burgess",
        "Information": "Kevin Burgess served as a Hunnewell Intern at the Arnold Arboretum, contributing to the institution's horticultural and educational missions. The Hunnewell Internship Program provides students in plant sciences with hands-on training in public horticulture, collections management, and arboreal sciences. During his tenure, Burgess worked alongside the Arboretum's team, gaining practical experience in managing the historic landscape and its scientific collection of trees and shrubs."
    },
    {
        "Name": "Bob Famiglietti",
        "Information": "Bob Famiglietti is a contributor to Arnoldia, the magazine of the Arnold Arboretum of Harvard University. He authored annual weather summaries for the Arboretum, including \"2009 Weather at the Arboretum\" in Arnoldia Volume 67, Issue 4 (2010), \"2010 Weather at the Arboretum\" in Volume 68, Issue 4 (2011), and \"2011 Weather Summary\" in Volume 69, Issue 4 (2012). These articles provide detailed accounts of the Arboretum's climatic conditions, offering valuable insights into the environmental factors influencing its living collections."
    },
    {
        "Name": "Michael S. Dosmann",
        "Information": "Michael S. Dosmann is the Keeper of the Living Collections at the Arnold Arboretum of Harvard University, a role he has held since 2017. Prior to this, he served as Curator of the Living Collections starting in 2007. In his current position, Dosmann oversees the curation and development of the Arboretum's extensive collection of temperate woody plants, which includes over 15,000 accessioned specimens. His responsibilities encompass plant acquisition, documentation, and mapping, as well as leading plant exploration efforts in regions such as East Asia and North America. In recognition of his contributions to botanical exploration and horticulture, Dosmann was awarded the David Fairchild Medal for Plant Exploration in 2019."
    },
    {
        "Name": "Andrew Bell",
        "Information": "Andrew Bell is a horticulturist who has collaborated with the Arnold Arboretum on plant exploration initiatives. In 1997, he participated in the North American China Plant Exploration Consortium (NACPEC) expedition, contributing to the collection and study of diverse plant species. Bell's involvement in such expeditions has enhanced the Arboretum's living collections and supported its mission of plant conservation and research."
    },
    {
        "Name": "Sam Schmerler",
        "Information": "Sam Schmerler is an author who has contributed to Arnoldia, the magazine of the Arnold Arboretum of Harvard University. In 2012, he wrote an article titled \"Plainly Unique: Schisandra chinensis,\" published in Arnoldia Volume 69, Issue 3. This article highlights the distinctive characteristics of Schisandra chinensis, a plant species known for its unique attributes."
    },
    {
        "Name": "Oren McBee",
        "Information": "Oren McBee is a plant breeder at Bailey Innovations, a division of Bailey Nurseries. His passion for plants began in childhood, leading him to pursue a career in horticulture. McBee has served as the Greenhouse and Nursery Manager at the Atlanta Botanical Garden in Gainesville and at Harvard University's Arnold Arboretum. He holds bachelor's and master's degrees in horticulture from the University of Georgia, where he studied under Dr. Michael Dirr."
    },
    {
        "Name": "David Giblin",
        "Information": "David Giblin is a research scientist and the collections manager at the University of Washington Herbarium, Burke Museum. His work focuses on the floristics of Pacific Northwest vascular plants, contributing significantly to the understanding and documentation of regional biodiversity. Giblin has also collaborated with the Arnold Arboretum on plant exploration initiatives, including the 2018 Oregon and Washington Expedition, where he and his team collected various plant species to enhance the Arboretum's living collections."
    },
    {
        "Name": "Todd Forrest",
        "Information": "Todd Forrest is a horticulturist who has contributed to Arnoldia, the magazine of the Arnold Arboretum. One of his articles, \"The Trees of North America: Michaux and Nuttall,\" published in 2011, explores the work of François André Michaux and Thomas Nuttall in studying North American trees. Forrest has also participated in educational efforts at the Arboretum, focusing on woody plants and horticultural practices. His work supports broader understanding and engagement in botany and plant conservation."
    },
    {
        "Name": "Reni Driskill",
        "Information": "Reni Driskill served as a Hunnewell Intern at the Arnold Arboretum, contributing to the institution's horticultural and educational missions. The Hunnewell Internship Program provides students in plant sciences with hands-on training in public horticulture, collections management, and arboreal sciences. During her tenure, Driskill worked alongside the Arboretum's team, gaining practical experience in managing the historic landscape and its scientific collection of trees and shrubs."
    },
    {
        "Name": "Julie Coop",
        "Information": "Julie Coop is the Horticulture Manager at the Arnold Arboretum of Harvard University. In this role, she oversees the maintenance and development of the Arboretum's living collections, ensuring their health and vitality. Coop has been instrumental in various projects, including the renovation of the Azalea Border, where she collaborated with Arboretum curator Michael Dosmann to procure and plant new azalea species. Her efforts contribute to the Arboretum's mission of plant conservation and public education."
    },
    {
        "Name": "Megan Ardolino",
        "Information": "Megan Ardolino joined the Arnold Arboretum in 2022 as the Plant Growth Facilities Manager at the Weld Hill Research Center. With a background in organic vegetable production and indoor cultivation, she oversees the Arboretum's plant growth environments, supporting research and conservation efforts. Ardolino is a member of organizations such as the Massachusetts Audubon Society and Botanic Gardens Conservation International, reflecting her commitment to botanical sciences."
    },
    {
        "Name": "Beth Knorr",
        "Information": "Beth Knorr served as a Hunnewell Intern at the Arnold Arboretum, contributing to the institution's horticultural and educational missions. The Hunnewell Internship Program provides students in plant sciences with hands-on training in public horticulture, collections management, and arboreal sciences. During her tenure, Knorr worked alongside the Arboretum's team, gaining practical experience in managing the historic landscape and its scientific collection of trees and shrubs."
    },
    {
        "Name": "John Burrows",
        "Information": "John Burrows is a botanist who has collaborated with the Arnold Arboretum on fieldwork and plant taxonomy projects. In 2002, he participated in a botanical survey of the Nyika Plateau in Malawi and Zambia, alongside other experts, including representatives from the Arnold Arboretum. This expedition aimed to document the region's flora, resulting in the publication \"Plants of the Nyika Plateau,\" which serves as a comprehensive resource on the area's plant diversity."
    },
    {
        "Name": "Kirsten \"Kit\" Ganshaw",
        "Information": "Kirsten \"Kit\" Ganshaw is a Horticultural Technologist at the Arnold Arboretum of Harvard University. In this role, she oversees the care and maintenance of the Bradley Rosaceous Collection, which features a diverse array of plants from the rose family. In 2009, Ganshaw played a pivotal role in the redesign of this collection, collaborating with her team to reorganize and enhance the display of the Arboretum's extensive rose-family plants. Her expertise ensures the health and vitality of these collections."
    },
    {
        "Name": "Sarah Carter",
        "Information": "Sarah Carter is the Olga C. de Goizueta Vice President of Goizueta Gardens and Living Collections at the Atlanta History Center. Her career in public horticulture began with a college internship in curation at the Arnold Arboretum of Harvard University. Carter then served as Curator of Herbaceous Plants and Outdoor Gardens at the New York Botanical Garden for five years. She later completed a Diploma in Garden Design from the UK's Garden Design School. Upon returning to the U.S., she began consulting for the Atlanta History Center, leading to her current position. In this role, Carter oversees the development, curation, and preservation of the 33-acre public garden, which includes three historic houses. She has written for numerous publications and has been featured on various media platforms."
    },
    {
        "Name": "Sandra Elsik",
        "Information": "Sandra Elsik served as a curatorial associate at the Arnold Arboretum, where she played a significant role in the verification project aimed at reviewing and upgrading the living collections. Her work involved vouchering and taxonomic review of the Arboretum's accessions, ensuring accurate documentation and maintenance of plant records. Elsik co-authored an article titled \"Behind the Scenes at the Arnold Arboretum,\" which details the processes and challenges involved in curating the living collections."
    },
    {
        "Name": "John S. DelRosso",
        "Information": "John S. DelRosso has been the Head Arborist at the Arnold Arboretum since 2002, after joining as an arborist in 1993. He initiated the Arboretum's first plant health care program in 1998. DelRosso holds a degree in forestry and previously worked with the Massachusetts Department of Conservation and Recreation. His expertise encompasses urban tree care, plant health, and arboriculture."
    },
    {
        "Name": "Stefan Helleckes",
        "Information": "Stefan Helleckes participated in the Isabella Welles Hunnewell Internship Program at the Arnold Arboretum in 2010. This program offers students in plant sciences hands-on training in public horticulture, collections management, and arboricultural practices. During his internship, Helleckes worked alongside the Arboretum's horticultural team, gaining practical experience in managing the historic landscape and its diverse plant collections."
    },
    {
        "Name": "Lidia Szabo",
        "Information": "Lidia Szabo participated in the Isabella Welles Hunnewell Internship Program at the Arnold Arboretum in 1996. She went on to be grounds staff from 1998."
    },
    {
        "Name": "John Creasey",
        "Information": "John Creasey participated in the Isabella Welles Hunnewell Internship Program at the Arnold Arboretum in 1995."
    },
    {
        "Name": "Julane Fagnant",
        "Information": "Julane Fagnant participated in the Isabella Welles Hunnewell Internship Program at the Arnold Arboretum in 1991. She went on to be staff assistant at the plant records from 1991."
    },
    {
        "Name": "Dr. Peter J. Zale",
        "Information": "Dr. Peter J. Zale is the Associate Director of Conservation, Plant Breeding, and Collections at Longwood Gardens in Pennsylvania. In this role, he oversees the development and curation of the garden's extensive plant collections, emphasizing conservation and plant breeding initiatives. Dr. Zale has collaborated with the Arnold Arboretum on various projects, including plant exploration and research. Notably, he co-authored articles in Arnoldia, such as \"Honeysuckles and Hospitality\" and \"Quest for Southern Red Oak—North of the Mason-Dixon Line,\" detailing field expeditions and plant collection efforts."
    },
    {
        "Name": "Donald Wyman",
        "Information": "Donald Wyman (1904–1993) was a prominent American horticulturist who served as the head of horticulture at Harvard University's Arnold Arboretum from 1935 to 1970. During his tenure, he significantly enhanced the Arboretum's plant collections and was instrumental in the development of the 'Donald Wyman' flowering crabapple (Malus 'Donald Wyman'). Wyman authored several influential horticultural texts, including Shrubs and Vines for American Gardens and Trees for American Gardens, which remain valuable resources in the field."
    },
    {
        "Name": "Donna A. Lynch",
        "Information": "Donna A. Lynch has been associated with the Arnold Arboretum, contributing to its educational and outreach initiatives. In 1985, she authored an article titled \"Labelling,\" published in Arnoldia. This piece discusses the importance of accurate plant labeling within the Arboretum's collections, highlighting the challenges and methodologies involved in maintaining precise identification for educational and research purposes."
    },
    {
        "Name": "Ricardo R. Austrich",
        "Information": "Ricardo R. Austrich is a landscape architect and author who was a Hunnewell Intern at the Arnold Arboretum in 1986. In 1987, he authored two articles in Arnoldia: \"El Real Jardín Botánico de Madrid and the Glorious History of Botany in Spain\" and \"The Madrid Botanical Garden Today: A Brief Photographic Portfolio.\" These works explore the history and contemporary state of the Royal Botanical Garden of Madrid, highlighting its significance in botanical science."
    },
    {
        "Name": "Miles Schwartz Sax",
        "Information": "Miles Schwartz Sax is the Assistant Curator at the Arnold Arboretum of Harvard University, where he coordinates the China Conservation Collaboration Initiative. This initiative focuses on collecting, preserving, and studying China's botanical heritage. Before joining the Arboretum, Sax served as Director of the Connecticut College Arboretum and was an adjunct associate professor of botany. His career began as an apprentice in horticulture and curation at the Arnold Arboretum. In his current role, he administers activities related to plant collection and research, contributing to the Arboretum's mission of plant conservation and education."
    },
    {
        "Name": "E Paul (Paul W. Meyer)",
        "Information": "Paul W. Meyer (1952–2023) was a distinguished American horticulturist renowned for his transformative leadership at the Morris Arboretum of the University of Pennsylvania. Serving as the F. Otto Haas Executive Director from 1991 until 2019, Meyer's tenure spanned over 43 years, during which he elevated the Arboretum into a world-class public garden. He was a key partner of the Arnold Arboretum, participating in plant exploration expeditions and serving on several committees. His collaborative efforts enriched living collections and advanced the mission of botanical gardens nationwide."
    },
    {
        "Name": "Ulli Groetsch",
        "Information": "Ulli Groetsch participated in the Isabella Welles Hunnewell Internship Program at the Arnold Arboretum in 2010. The program provides hands-on experience in public horticulture, focusing on collections and landscape management as well as arboreal sciences. This opportunity allowed participants like Groetsch to contribute to the Arboretum’s mission while gaining practical knowledge and skills in the plant sciences."
    },
    {
        "Name": "Abby Hird Meyer",
        "Information": "Abby Hird Meyer is a botanist and conservationist who served as a Putnam Fellow at the Arnold Arboretum. During her fellowship, she co-authored \"A Quarter-Century Perspective on the Center for Plant Conservation Collections at the Arnold Arboretum\" in Arnoldia in 2012. In 2009, Hird Meyer discovered an aberrant white-flowering branch on an Eastern redbud (Cercis canadensis) at the Arboretum, leading to the introduction of the 'Arnold Banner' cultivar. She currently serves as the Executive Director of Botanic Gardens Conservation International-U.S."
    },
    {
        "Name": "Margo W. Reynolds",
        "Information": "Margo W. Reynolds served as a Staff Assistant at the Arnold Arboretum from 1977 to 1981. She managed the Arboretum's Community Gardens, overseeing plot allocations and coordinating with gardeners. Reynolds also contributed to the Arboretum's publications, authoring articles such as \"Portrait of a Plant Propagator,\" which profiled Alfred J. Fordham's work. Her efforts supported the Arboretum's mission of plant conservation and public education."
    },
    {
        "Name": "Beth Bardon",
        "Information": "Beth Bardon was a mapping and labeling intern at the Arnold Arboretum. During her internship, she gained hands-on experience with the Arboretum's plant collections, interacting with numerous plants over a concentrated period. Her work contributed to the Arboretum’s plant documentation and labeling efforts."
    },
    {
        "Name": "James \"Jim\" Papargiris",
        "Information": "James \"Jim\" Papargiris began his career at the Arnold Arboretum in 1979, initially hired for his mechanical skills and landscaping experience. Over the years, he advanced through various roles, becoming the Arboretum Working Foreperson in 2004. In this capacity, he oversees daily horticultural operations, equipment maintenance, and contractor coordination, ensuring the smooth functioning of the Arboretum's grounds."
    },
    {
        "Name": "R. Elaine Joines",
        "Information": "R. Elaine Joines was a member of the Isabella Welles Hunnewell Intern Class of 1985 at the Arnold Arboretum, where she contributed to the institution's horticultural programs."
    },
    {
        "Name": "Bruce Hegna",
        "Information": "Bruce Hegna was a member of the Isabella Welles Hunnewell Intern Class of 1989 at the Arnold Arboretum. During the 1980s, he assisted with field checking and label replacement, and later co-created a distinctive garden in Portland, Oregon."
    },
    {
        "Name": "Jennifer \"Jen\" Kettell",
        "Information": "Jennifer \"Jen\" Kettell is a consulting arborist and horticulturist. She worked for over a decade at the Arnold Arboretum, gaining extensive experience in public horticulture and collections management. After leaving the Arboretum, she founded Radiant Leaf Consulting, focusing on responsible plant stewardship. Kettell is an ISA Board Certified Master Arborist and a Massachusetts Certified Horticulturist."
    },
    {
        "Name": "Paul Pfeifer",
        "Information": "Paul Pfeifer was a summer intern at the Arnold Arboretum, where he was introduced to New England horticulture and mentored by leading professionals."
    },
    {
        "Name": "Stephen A. Spongberg",
        "Information": "Stephen A. Spongberg (1942–2021) was a botanist and curator at the Arnold Arboretum from 1970 to 1998. He oversaw living collections and the herbarium, and was instrumental in international plant exploration, including a 1977 expedition to Japan and South Korea and the 1980 Sino-American Botanical Expedition. He authored \"A Reunion of Trees,\" chronicling the history of plant exploration."
    },
    {
        "Name": "Elizabeth Caffrey",
        "Information": "Elizabeth Caffrey was a member of the Isabella Welles Hunnewell Internship Class of 1992 at the Arnold Arboretum, gaining experience in public horticulture and collections management."
    },
    {
        "Name": "Hannah Voorhees",
        "Information": "Hannah Voorhees was an Isabella Welles Hunnewell Intern at the Arnold Arboretum in 2002, gaining practical experience in managing the Arboretum's living collections."
    },
    {
        "Name": "William Laky",
        "Information": "William Laky was a member of the Isabella Welles Hunnewell Intern Class of 1982 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Jeff Unger",
        "Information": "Jeff Unger was a member of the Isabella Welles Hunnewell Intern Class of 2005 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Emma Schiffman",
        "Information": "Emma Schiffman was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Julia Hintringer",
        "Information": "Julia Hintringer was a member of the Isabella Welles Hunnewell Intern Class of 1990 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Sara Straate",
        "Information": "Sara Straate was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Fritz Bottger",
        "Information": "Fritz Bottger was a member of the Isabella Welles Hunnewell Intern Class of 1998 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Carol Kohler",
        "Information": "Carol Kohler was a member of the Isabella Welles Hunnewell Intern Class of 1990 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Emily Sampson",
        "Information": "Emily Sampson was a member of the Isabella Welles Hunnewell Intern Class of 2006 at the Arnold Arboretum, contributing to horticultural programs. Afterward, she studied Ecology and Evolutionary Biology at the University of North Carolina at Asheville and founded Patchwork Meadows, advocating for native plants and pollinator habitats."
    },
    {
        "Name": "Mary Mohrin",
        "Information": "Mary Mohrin was a Plant Records Summer Intern at the Arnold Arboretum in 2002, contributing to the documentation and management of the living collections."
    },
    {
        "Name": "Bob Famiglietti",
        "Information": "Bob Famiglietti is a Horticultural Technologist at the Arnold Arboretum's Dana Greenhouses, focusing on plant propagation and cultivation for the Arboretum’s living collections."
    },
    {
        "Name": "Scott Ritchie",
        "Information": "Scott Ritchie was a member of the Isabella Welles Hunnewell Intern Class of 1995 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Sheila (Robertson) Magullion",
        "Information": "Sheila (Robertson) Magullion (1930–2023) was a horticulturist who began her career at the Arnold Arboretum, specializing in plant propagation. She later worked at the New England Wildflower Society, discovered a deep blue Lobelia named \"Sheila's Blue,\" and pioneered techniques for embedding herbarium specimens in plastic. Her legacy includes the Sheila and Frank Magullion Education and Retreat Center at Riverbend School."
    },
    {
        "Name": "Whitney O’Hanian",
        "Information": "Whitney O’Hanian was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Bruce Munch",
        "Information": "Bruce Munch was a member of the grounds staff at the Arnold Arboretum during the 1980s and 1990s, assisting in landscape maintenance."
    },
    {
        "Name": "Kristen DeSouza",
        "Information": "Kristen DeSouza was a member of the Isabella Welles Hunnewell Intern Class of 2004 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Sarah Thompson",
        "Information": "Sarah Thompson was a member of the Isabella Welles Hunnewell Intern Class of 2005 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Kirsten Thornton",
        "Information": "Kirsten Thornton was a member of the Isabella Welles Hunnewell Intern Class of 1994 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Lauren Buckland",
        "Information": "Lauren Buckland was a member of the Isabella Welles Hunnewell Intern Class of 1996 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Nicki Richardson",
        "Information": "Nicki Richardson was a member of the Isabella Welles Hunnewell Intern Class of 1998 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Karlton Holmes",
        "Information": "Karlton Holmes was a member of the Isabella Welles Hunnewell Intern Class of 1990 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Robert \"Bob\" Siegel",
        "Information": "Robert \"Bob\" Siegel was a volunteer at the Arnold Arboretum in the early 1980s, aiding in field checking and label replacement to maintain accurate plant records."
    },
    {
        "Name": "Matthew Coyner",
        "Information": "Matthew Coyner was a member of the Isabella Welles Hunnewell Intern Class of 1998 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Andrea Murmann",
        "Information": "Andrea Murmann was a member of the Isabella Welles Hunnewell Intern Class of 1991 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Nicholas Slabyj",
        "Information": "Nicholas Slabyj was a member of the Isabella Welles Hunnewell Intern Class of 1991 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Warren Reichle",
        "Information": "Warren Reichle was a member of the Isabella Welles Hunnewell Intern Class of 2003 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Anett Hofmann",
        "Information": "Anett Hofmann was a member of the Isabella Welles Hunnewell Intern Class of 2002 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Wesley Kalloch",
        "Information": "Wesley Kalloch has been a horticulturist at the Arnold Arboretum since 2006, managing conifer collections and composting initiatives. He collaborated with local businesses to enhance compost quality for the Arboretum’s plant collections."
    },
    {
        "Name": "Daniel March",
        "Information": "Daniel March was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Abram J. Bicksler",
        "Information": "Abram J. Bicksler was a member of the Isabella Welles Hunnewell Intern Class of 2002 at the Arnold Arboretum. He later pursued advanced studies in sustainable agriculture, served at ECHO’s Asia Regional Impact Center, worked at the FAO, and became President and CEO of ECHO International, focusing on global hunger reduction through sustainable farming."
    },
    {
        "Name": "Keith LeBlanc",
        "Information": "Keith LeBlanc was a member of the Isabella Welles Hunnewell Intern Class of 1993 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Matt Connelly",
        "Information": "Matt Connelly worked for seven years at the Arnold Arboretum, contributing to horticultural operations and plant conservation. After leaving, he moved into commercial landscaping with Skyline Landscapes in Boston."
    },
    {
        "Name": "John Backer",
        "Information": "John Backer was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Gwen Newman",
        "Information": "Gwen Newman was a member of the Isabella Welles Hunnewell Intern Class of 1998 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Phillip Kopf",
        "Information": "Phillip Kopf was a member of the Isabella Welles Hunnewell Intern Class of 2000 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Todd Burns",
        "Information": "Todd Burns was a member of the Isabella Welles Hunnewell Intern Class of 1992 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Kea Woodruff",
        "Information": "Kea Woodruff is a plant growth facilities manager at the Arnold Arboretum. In 2017, she co-led the Arkansas-Missouri Expedition and has authored Arnoldia articles detailing plant-collecting efforts. In 2018, she and Tiffany Enzenbacher conducted the Arboretum's first all-female collecting expedition in the Ozarks."
    },
    {
        "Name": "Jeremy Fink",
        "Information": "Jeremy Fink was a member of the Isabella Welles Hunnewell Intern Class of 1995 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Aneiage Van Batenburg",
        "Information": "Aneiage Van Batenburg was a member of the Isabella Welles Hunnewell Intern Class of 2003 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Scott Grimshaw",
        "Information": "Scott Grimshaw has been a horticulturist at the Arnold Arboretum since 2004, responsible for Bussey Hill and the Explorers Garden. Previously at Roger Williams Park Zoo, he contributed to the redesign of the Bradley Rosaceous Collection."
    },
    {
        "Name": "Tom Akin",
        "Information": "Tom Akin served as the Manager of the Intern Program at the Arnold Arboretum in 1998, guiding Hunnewell Interns. He later worked as a Conservation Agronomist for the USDA NRCS, focusing on soil health and sustainability."
    },
    {
        "Name": "Rebecca Govier",
        "Information": "(Duplicate entry for clarity) Rebecca Govier is a garden designer and owner of Green Edge Garden Design in Edinburgh, Scotland. Her experience includes working at the Arnold Arboretum, engaging with international visitors to share horticultural best practices."
    },
    {
        "Name": "Eric Hsu",
        "Information": "Eric Hsu is a botanist who served as a Putnam Fellow at the Arnold Arboretum from 2005 to 2006, researching the Acer collection. He later became plant information coordinator at Chanticleer Garden and contributed to various horticultural institutions and publications."
    },
    {
        "Name": "James A. Doyle",
        "Information": "James A. Doyle is a botanist affiliated with the University of California, Davis. He has contributed to the Journal of the Arnold Arboretum, notably with research on Cretaceous angiosperm pollen."
    },
    {
        "Name": "Mark Walkama",
        "Information": "Mark Walkama is a horticulturist at the Arnold Arboretum, involved in planting efforts such as the paperbark maple (Acer griseum) sourced from a 2015 expedition."
    },
    {
        "Name": "Rose Morgan",
        "Information": "Rose Morgan was a member of the Isabella Welles Hunnewell Intern Class of 2001 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Patrick Willoughby",
        "Information": "Patrick Willoughby began his horticultural career at the Arnold Arboretum and later joined Wellesley College, contributing to the Landscape Master Plan and sustainability initiatives."
    },
    {
        "Name": "Robert Ervin",
        "Information": "Robert Ervin has been an arborist at the Arnold Arboretum since 2002, focusing on sustainable arboricultural practices, structural pruning, and minimal intervention. He holds degrees in forestry and urban forestry."
    },
    {
        "Name": "Kyle Stephens",
        "Information": "Kyle Stephens began as an Arborist Apprentice at the Arnold Arboretum in 2006 and later became an Arborist. Afterward, he founded Woody Plant Care, emphasizing proper pruning and planting."
    },
    {
        "Name": "Marc Fortenberry",
        "Information": "Marc Fortenberry was a member of the Isabella Welles Hunnewell Intern Class of 1998 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Leanne Erickson",
        "Information": "Leanne Erickson was a member of the Isabella Welles Hunnewell Intern Class of 1999 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Tomás Zicha",
        "Information": "Tomás Zicha is a horticulturist trained at SLU Alnarp in Sweden, with further education at the Arnold Arboretum and Morris Arboretum. Since 2004, he has worked at Uppsala University's Linnaean Gardens as an academy gardener, overseeing garden maintenance and digital mapping."
    },
    {
        "Name": "Seth Cain",
        "Information": "Seth Cain was a member of the Isabella Welles Hunnewell Intern Class of 1996 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Ryk Gupta",
        "Information": "Ryk Gupta was a member of the Isabella Welles Hunnewell Intern Class of 1999 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Benjamin Zaitchik",
        "Information": "Benjamin Zaitchik worked as a Putnam Fellow at the Arnold Arboretum, researching how climate variability impacts plant communities. His work contributed to understanding the relationship between climate and plant distribution."
    },
    {
        "Name": "Laura Tenny Brogna",
        "Information": "Laura Tenny Brogna served as the Landscape Projects Manager at the Arnold Arboretum, overseeing plant selection and landscaping initiatives. She contributed to committees shaping the Arboretum’s collections."
    },
    {
        "Name": "Rob Nicholson",
        "Information": "Rob Nicholson, former assistant plant propagator at the Arnold Arboretum, participated in over thirty expeditions, enriching the living collections with nearly 2,000 wild specimens. He authored Arnoldia articles and contributed to plant exploration and conservation efforts."
    },
    {
        "Name": "Dana Doyle",
        "Information": "Dana Doyle was a member of the Isabella Welles Hunnewell Intern Class of 1996 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Alice Kitajima",
        "Information": "Alice Kitajima co-authored research at the Arnold Arboretum on Chinese hemlock (Tsuga chinensis) and its resistance to hemlock woolly adelgid, indicating potential as a resistant landscape alternative."
    },
    {
        "Name": "Elizabeth \"Bess\" Wellborn",
        "Information": "Elizabeth \"Bess\" Wellborn was a member of the Isabella Welles Hunnewell Intern Class of 1997 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Hardy Stecker",
        "Information": "Hardy Stecker was a member of the Isabella Welles Hunnewell Intern Class of 2002 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Robert S. Hebb",
        "Information": "Robert S. Hebb served as Assistant Horticulturist at the Arnold Arboretum and co-led a 1975 expedition to the Soviet Union, collecting plant material. He authored numerous Arnoldia articles on horticulture."
    },
    {
        "Name": "Sean Walker",
        "Information": "Sean Walker was a member of the Isabella Welles Hunnewell Intern Class of 2009 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Elizabeth Heriza",
        "Information": "Elizabeth Heriza was a member of the Isabella Welles Hunnewell Intern Class of 1992 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Davita Moyer",
        "Information": "Davita Moyer was a member of the Isabella Welles Hunnewell Intern Class of 2010 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Charlotte Enfield",
        "Information": "Charlotte Enfield was a member of the Isabella Welles Hunnewell Intern Class of 2005 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Rebecca Govier",
        "Information": "(Duplicate entry for completeness) As noted, she is a garden designer and owner of Green Edge Garden Design in Edinburgh, with experience working at the Arnold Arboretum."
    },
    {
        "Name": "Karl E. Flinck",
        "Information": "Karl E. Flinck, a Swedish horticulturist, collaborated with the Arnold Arboretum by cultivating plants from seeds collected in China, notably Magnolia cylindrica 'Bjuv'. His work exemplifies international botanical partnerships."
    },
    {
        "Name": "Susan Wiegrefe",
        "Information": "Susan Wiegrefe is associated with The Morton Arboretum, emphasizing effective communication of scientific concepts in arboriculture and horticulture."
    },
    {
        "Name": "Rachel Deakins",
        "Information": "Rachel Deakins was a member of the Isabella Welles Hunnewell Intern Class of 2008 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Spencer Sears",
        "Information": "Spencer Sears was a member of the Isabella Welles Hunnewell Intern Class of 1997 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Jennifer Reimer Quigley",
        "Information": "Jennifer Reimer Quigley (1946–1994) served as a curatorial associate in the plant records office at the Arnold Arboretum, enhancing documentation and research capabilities."
    },
    {
        "Name": "Richard E. \"Dick\" Weaver, Jr.",
        "Information": "Richard E. \"Dick\" Weaver, Jr. served as a horticultural taxonomist and assistant curator at the Arnold Arboretum from 1970 to 1998, introducing numerous plant species and expanding the Arboretum’s botanical diversity."
    },
    {
        "Name": "David C. Michener",
        "Information": "David C. Michener is a research taxonomist formerly affiliated with the Arnold Arboretum. He now serves as a faculty curator at the University of Michigan’s Matthaei Botanical Gardens and Nichols Arboretum, focusing on plant conservation and restoration."
    },
    {
        "Name": "Jessica Blohm",
        "Information": "Jessica Blohm served as a gardener at the Arnold Arboretum from 2004 to 2006, maintaining the living collections."
    },
    {
        "Name": "Audrey Spencer",
        "Information": "Audrey Spencer, a PhD student at the University of Colorado Denver and Denver Botanic Gardens, received the 2022 Deland Award from the Arnold Arboretum for her research in botanical conservation."
    },
    {
        "Name": "C.J. Patterson",
        "Information": "C.J. Patterson is a Massachusetts Chapter member and serves as the Plant Information Officer at the Arnold Arboretum, providing expertise and guidance on its plant collections."
    },
    {
        "Name": "Hugh McAllister",
        "Information": "Hugh McAllister, Honorary Lecturer at the University of Liverpool and Visiting Scholar at the Arnold Arboretum, received the Sargent Award in 2012. He is known for his expertise in Sorbus taxonomy and conservation."
    },
    {
        "Name": "Claire Corcoran",
        "Information": "Claire Corcoran was a member of the Isabella Welles Hunnewell Intern Class of 1999 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Jessica Abramavicius",
        "Information": "Jessica Abramavicius was a member of the Isabella Welles Hunnewell Intern Class of 1999 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Dave Richards",
        "Information": "Dave Richards was a member of the Isabella Welles Hunnewell Intern Class of 2006 at the Arnold Arboretum, contributing to horticultural programs."
    },
    {
        "Name": "Bethany Grasso",
        "Information": "Bethany Grasso worked as a gardener at the Arnold Arboretum between 2000 and 2001, serving on the plant selection committee and helping shape the collections. She went on to be grounds staff."
    },
    {
        "Name": "Donald Garrick",
        "Information": "Donald Garrick served as a Horticultural Technologist at the Arnold Arboretum, contributing to plant care and management. He resigned on July 8, 2003."
    },
    {
        "Name": "Peter Del Tredici",
        "Information": "Peter Del Tredici served as a senior research scientist at the Arnold Arboretum for 35 years, curated the Larz Anderson Bonsai Collection, edited Arnoldia, and conducted research on Ginkgo biloba and urban ecology."
    },
    {
        "Name": "Stephen Schneider",
        "Information": "Stephen Schneider serves as the Director of Operations at the Arnold Arboretum. He co-led a 2018 expedition to Honshu, Japan, participated in the renovation of the Bradley Rosaceous Collection, and helped eradicate the Asian longhorned beetle from the Arboretum."
    }
]